//
//  NetError.swift
//  Somniary
//
//  Created by 송태환 on 12/23/25.
//

import Foundation

struct NetError: Decodable {
    let code: NetErrorCode
    let details: String?
    let hint: String?
    let message: String

    #if DEBUG
    var deubgMessage: String {
        return """
        ╔══════════════════════════════════════════════════════════════
        ║ 💥 PostgREST Error Details
        ╠══════════════════════════════════════════════════════════════
        ║ 🎯 Error Code : \(self.code)
        ║ 💬 Message    : \(self.message)
        ╠──────────────────────────────────────────────────────────────
        ║ 💬 Details    : \(String(describing: self.details))
        ║ 📄 Hint       : \(String(describing: self.hint))
        ╠──────────────────────────────────────────────────────────────
        ║ ⏰ Time       : \(Date.now.formatted(date: .numeric, time: .standard))
        ╚══════════════════════════════════════════════════════════════
        """
    }
    #endif
}
